# Minimal Key constraint: We cannot remove column constraint, if we remove it breaks the primary key constraint.
#### EX: primary key (stud_id, crs_id) we cannot remove crs_id in the constraint, it is minimal

## Natural key: (ex: adhaar, email, etc...)
## Surrogate key: 
#### Its a concept, whenever we don't have any unique column while designing database or table, we create an unique column artificially (system generated column) to identify a record uniquely which is called surrogate key

### 1. Candidate key: 
##### All primary keys are candidate keys, all composite primary keys are candidate keys
##### Column which is eligible to be a primary key, is called candidate key

### 2. Super key:
##### All primary keys are super keys
##### All candidate keys are super keys
##### But all super keys cannot be a candidate key

### 3. Primary key: 
##### Identifies each record uniquely

### 4. Composite key:
##### Combination of primary keys in database/table

## Aggregation functions in SQL
#### 1. Minimum
#### 2. Maximum
#### 3. Sum
#### 4. Average
#### 5. Count

In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:mysql@localhost

In [2]:
%%sql

use de_projects;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [4]:
%%sql

create table retail (cust_id int primary key,
                    cust_name varchar(50) not null,
                    prod_name varchar(50) not null,
                    order_date date not null,
                    price decimal(10,2),
                    payment_completed varchar(50) check (payment_completed in ('completed', 'failed', 'pending'))
                    );

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [5]:
%%sql

insert into de_projects.retail values (1, 'ram', 'mobile', '2024-08-23', 28900.67, 'completed');
insert into de_projects.retail values (2, 'raj', 'hair dryer', '2024-06-29', 899.89, 'completed');
insert into de_projects.retail values (3, 'laura', 'oven', '2025-01-23', 7908.78, 'pending');
insert into de_projects.retail values (4, 'ancy', 'fridge', '2021-09-19', 26897.78, 'completed');
insert into de_projects.retail values (5, 'ananth', 'washing machine', '2025-03-23', 45897.90, 'failed');
insert into de_projects.retail values (6, 'sam', 'cooker', '2019-09-25', 1200.89, 'pending');
insert into de_projects.retail values (7, 'angel', 'table', '2020-09-19', 1890.90, 'completed');
insert into de_projects.retail values (8, 'joe', 'laptop', '2023-10-21', 67890.78, 'completed');
insert into de_projects.retail values (9, 'micheal', 'heater', '2020-11-30', 2300.00, 'pending');
insert into de_projects.retail values (10, 'john', 'twister', '2021-09-23', 490.00, 'failed');
insert into de_projects.retail values (11, 'ana', 'serum', '2024-07-30', 290.90, 'failed');
select * from de_projects.retail;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
11 rows affected.

[(1, 'ram', 'mobile', datetime.date(2024, 8, 23), Decimal('28900.67'), 'completed'),
 (2, 'raj', 'hair dryer', datetime.date(2024, 6, 29), Decimal('899.89'), 'completed'),
 (3, 'laura', 'oven', datetime.date(2025, 1, 23), Decimal('7908.78'), 'pending'),
 (4, 'ancy', 'fridge', datetime.date(2021, 9, 19), Decimal('26897.78'), 'completed'),
 (5, 'ananth', 'washing machine', datetime.date(2025, 3, 23), Decimal('45897.90'), 'failed'),
 (6, 'sam', 'cooker', datetime.date(2019, 9, 25), Decimal('1200.89'), 'pending'),
 (7, 'angel', 'table', datetime.date(2020, 9, 19), Decimal('1890.90'), 'completed'),
 (8, 'joe', 'laptop', datetime.date(2023, 10, 21), Decimal('67890.78'), 'completed'),
 (9, 'micheal', 'heater', datetime.date(2020, 11, 30), Decimal('2300.00'), 'pending'),
 (10, 'john', 'twister', datetime.date(2021, 9, 23), Decimal('490.00'), 'failed'),
 (11, 'ana', 'serum', datetime.date(2024, 7, 30), Decimal('290.90'), 'failed')]

In [7]:
%%sql

# Query 01: Total revenue of all transactions
select sum(price) as Total_Revenue from de_projects.retail;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(Decimal('184568.49'),)]

In [8]:
%%sql

#Query 02: Total revenue based on payment completed
select sum(price) as Total_revenue from de_projects.retail where payment_completed = "completed";

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(Decimal('126480.02'),)]

In [9]:
%%sql

#Query 03: Count total number of orders
select count(*) as total_number_of_orders from de_projects.retail;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(11,)]

In [10]:
%%sql

#Query 04: Count the number of failed orders
select count(*) as failed_orders from de_projects.retail where payment_completed = "failed";

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(3,)]

In [11]:
%%sql

#Query 05: Count the number of pending orders
select count(*) as pending_orders from de_projects.retail where payment_completed = "pending";

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(3,)]

In [17]:
%%sql

#Query 06: Maximum amount obtained from orders
select max(price) as Maximum_amt_paid from de_projects.retail where payment_completed = "completed";

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(Decimal('67890.78'),)]

In [16]:
%%sql

#Query 07: Minimum amount obtained from orders
select min(price) as minimum_amt_obtained from de_projects.retail where payment_completed = "completed";

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(Decimal('899.89'),)]

In [19]:
%%sql

#Query 08: Average amount obtained from the completed transactions
select avg(price) as average_revenue from de_projects.retail where payment_completed = "completed";

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(Decimal('25296.004000'),)]

In [20]:
%%sql

#Query 09: Average amount in the pending trandsactions
select avg(price) as pending_transaction from de_projects.retail where payment_completed = "pending";

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(Decimal('3803.223333'),)]

In [26]:
%%sql

#Query 10: Transaction failed and pending orders
select * from de_projects.retail where payment_completed = "pending" or payment_completed = "failed";

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(3, 'laura', 'oven', datetime.date(2025, 1, 23), Decimal('7908.78'), 'pending'),
 (5, 'ananth', 'washing machine', datetime.date(2025, 3, 23), Decimal('45897.90'), 'failed'),
 (6, 'sam', 'cooker', datetime.date(2019, 9, 25), Decimal('1200.89'), 'pending'),
 (9, 'micheal', 'heater', datetime.date(2020, 11, 30), Decimal('2300.00'), 'pending'),
 (10, 'john', 'twister', datetime.date(2021, 9, 23), Decimal('490.00'), 'failed'),
 (11, 'ana', 'serum', datetime.date(2024, 7, 30), Decimal('290.90'), 'failed')]

#### 1. IN 
#### 2. NOT IN
#### 3.

#### **IN** keyword instead of OR operator

In [27]:
%%sql

#Query 11: using IN keyword
select * from de_projects.retail where payment_completed in ("pending", "failed");

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(3, 'laura', 'oven', datetime.date(2025, 1, 23), Decimal('7908.78'), 'pending'),
 (5, 'ananth', 'washing machine', datetime.date(2025, 3, 23), Decimal('45897.90'), 'failed'),
 (6, 'sam', 'cooker', datetime.date(2019, 9, 25), Decimal('1200.89'), 'pending'),
 (9, 'micheal', 'heater', datetime.date(2020, 11, 30), Decimal('2300.00'), 'pending'),
 (10, 'john', 'twister', datetime.date(2021, 9, 23), Decimal('490.00'), 'failed'),
 (11, 'ana', 'serum', datetime.date(2024, 7, 30), Decimal('290.90'), 'failed')]

#### **NOT IN** keyword

In [28]:
%%sql

select * from de_projects.retail where payment_completed not in ("pending", "failed");

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'ram', 'mobile', datetime.date(2024, 8, 23), Decimal('28900.67'), 'completed'),
 (2, 'raj', 'hair dryer', datetime.date(2024, 6, 29), Decimal('899.89'), 'completed'),
 (4, 'ancy', 'fridge', datetime.date(2021, 9, 19), Decimal('26897.78'), 'completed'),
 (7, 'angel', 'table', datetime.date(2020, 9, 19), Decimal('1890.90'), 'completed'),
 (8, 'joe', 'laptop', datetime.date(2023, 10, 21), Decimal('67890.78'), 'completed')]

In [32]:
%%sql

#Query 12: group by
select avg(price) as average_price, payment_completed from de_projects.retail group by payment_completed;

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[(Decimal('25296.004000'), 'completed'),
 (Decimal('3803.223333'), 'pending'),
 (Decimal('15559.600000'), 'failed')]

### IMP: Whenever using gruop by clause, use Having clause instead of where clause in sql
## where vs Having
### where: use when there are non aggregated values
### having: use when there are aggregated values

In [35]:
%%sql

#Query 13: list out the total revenue of each type of transactions and which should be greater than 10000
select sum(price) as total_revenue_received, payment_completed from de_projects.retail group by payment_completed having total_revenue_received > 10000;

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[(Decimal('126480.02'), 'completed'),
 (Decimal('11409.67'), 'pending'),
 (Decimal('46678.80'), 'failed')]

In [39]:
%%sql

select max(price) as maximum_revenue, payment_completed from de_projects.retail group by payment_completed having maximum_revenue > 15000;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[(Decimal('67890.78'), 'completed'), (Decimal('45897.90'), 'failed')]

## Case when

In [58]:
%%sql

drop table case_table;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [59]:
%%sql

create table case_table (gen_id int auto_increment primary key,
                        name varchar(50) not null,
                        ph_no integer(10) check (length(ph_no) = 10),
                        email varchar(50) );

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [60]:
%%sql

insert into case_table (name, ph_no, email) values ("sam", 1234567890, "abc@gmail.com");
insert into case_table (name, ph_no, email) values ("ram", 1987654321, "bcd@gmail.com");
insert into case_table (name, ph_no, email) values ("lauara", NULL, "def@gmail.com");
insert into case_table (name, ph_no, email) values ("jason", NULL, "efg@gmail.com");
insert into case_table (name, ph_no, email) values ("joe", NULL, "fgh@gmail.com");
select * from case_table;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
5 rows affected.

[(1, 'sam', 1234567890, 'abc@gmail.com'),
 (2, 'ram', 1987654321, 'bcd@gmail.com'),
 (3, 'lauara', None, 'def@gmail.com'),
 (4, 'jason', None, 'efg@gmail.com'),
 (5, 'joe', None, 'fgh@gmail.com')]

## Case When in SQL

In [61]:
%%sql

# If anyone does not have phone number then use their email address for contact
select 
    gen_id, name,
    case
        when ph_no is null then email
    else ph_no
    end as contact
from case_table;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'sam', '1234567890'),
 (2, 'ram', '1987654321'),
 (3, 'lauara', 'def@gmail.com'),
 (4, 'jason', 'efg@gmail.com'),
 (5, 'joe', 'fgh@gmail.com')]

In [62]:
%%sql

insert into case_table (name, ph_no, email) values ("raj", NULL, NULL);
insert into case_table (name, ph_no, email) values ("alex", NULL, NULL);
select * from case_table;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.
1 rows affected.
7 rows affected.

[(1, 'sam', 1234567890, 'abc@gmail.com'),
 (2, 'ram', 1987654321, 'bcd@gmail.com'),
 (3, 'lauara', None, 'def@gmail.com'),
 (4, 'jason', None, 'efg@gmail.com'),
 (5, 'joe', None, 'fgh@gmail.com'),
 (6, 'raj', None, None),
 (7, 'alex', None, None)]

In [66]:
%%sql

# If there were no phone number as well as email then name it as no contact details else give their phone number or email address
select 
    gen_id as id, name, 
        case
            when ph_no is null and email is null then "no contact details"
            when ph_no is null then email
        else ph_no
        end contact_details
    
from case_table;

 * mysql+mysqlconnector://root:***@localhost
7 rows affected.

[(1, 'sam', '1234567890'),
 (2, 'ram', '1987654321'),
 (3, 'lauara', 'def@gmail.com'),
 (4, 'jason', 'efg@gmail.com'),
 (5, 'joe', 'fgh@gmail.com'),
 (6, 'raj', 'no contact details'),
 (7, 'alex', 'no contact details')]

In [68]:
%%sql

select * from de_projects.retail;

 * mysql+mysqlconnector://root:***@localhost
11 rows affected.

[(1, 'ram', 'mobile', datetime.date(2024, 8, 23), Decimal('28900.67'), 'completed'),
 (2, 'raj', 'hair dryer', datetime.date(2024, 6, 29), Decimal('899.89'), 'completed'),
 (3, 'laura', 'oven', datetime.date(2025, 1, 23), Decimal('7908.78'), 'pending'),
 (4, 'ancy', 'fridge', datetime.date(2021, 9, 19), Decimal('26897.78'), 'completed'),
 (5, 'ananth', 'washing machine', datetime.date(2025, 3, 23), Decimal('45897.90'), 'failed'),
 (6, 'sam', 'cooker', datetime.date(2019, 9, 25), Decimal('1200.89'), 'pending'),
 (7, 'angel', 'table', datetime.date(2020, 9, 19), Decimal('1890.90'), 'completed'),
 (8, 'joe', 'laptop', datetime.date(2023, 10, 21), Decimal('67890.78'), 'completed'),
 (9, 'micheal', 'heater', datetime.date(2020, 11, 30), Decimal('2300.00'), 'pending'),
 (10, 'john', 'twister', datetime.date(2021, 9, 23), Decimal('490.00'), 'failed'),
 (11, 'ana', 'serum', datetime.date(2024, 7, 30), Decimal('290.90'), 'failed')]

In [70]:
%%sql

# List out pending and failed transactions using case when statement

select
    cust_id as customer_id, cust_name as customer_name, prod_name as product_name,
        case
            when price > 15000 and payment_completed in ("pending", "failed") then "Purchasing doubt"
            when payment_completed in ("failed", "pending") then payment_completed
        end as transaction_details
from de_projects.retail;

 * mysql+mysqlconnector://root:***@localhost
11 rows affected.

[(1, 'ram', 'mobile', None),
 (2, 'raj', 'hair dryer', None),
 (3, 'laura', 'oven', 'pending'),
 (4, 'ancy', 'fridge', None),
 (5, 'ananth', 'washing machine', 'Purchasing doubt'),
 (6, 'sam', 'cooker', 'pending'),
 (7, 'angel', 'table', None),
 (8, 'joe', 'laptop', None),
 (9, 'micheal', 'heater', 'pending'),
 (10, 'john', 'twister', 'failed'),
 (11, 'ana', 'serum', 'failed')]

## If we to see sample records we can use limit keyword with select statement

In [84]:
%%sql

select *from de_projects.retail limit 2;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[(1, 'ram', 'mobile', datetime.date(2024, 8, 23), Decimal('28900.67'), 'completed'),
 (2, 'raj', 'hair dryer', datetime.date(2024, 6, 29), Decimal('899.89'), 'completed')]